Revit 2024 API
InternalDefinitions Members
The InternalDefinitions type exposes the following members.
Methods
Name | Description
Contains
Tests for the existence of a definition within the set.
 (Inherited from Definitions.)
Create
Creates a new parameter definition using specified options.
 (Inherited from Definitions.)
Dispose |  (Inherited from Definitions.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
 (Inherited from Definitions.)
GetEnumerator
Retrieves an enumerator to the collection.
 (Inherited from Definitions.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsEmpty
Identifies if the definitions collection is empty.
 (Inherited from Definitions.)
Item
Retrieves a definition by a given name.
 (Inherited from Definitions.)
Size
The number of definitions in the collection.
 (Inherited from Definitions.)
See Also
InternalDefinitions Class
Autodesk.Revit.DB Namespace